# Collect Data In One Place
In this notebook we will collect both data file in one file to use them in goodreads and to make sure that there is no duplicates in data

In [1]:
import pandas as pd
import numpy as np

In [2]:
diwan_df = pd.read_csv('Diwan_books_only_isbn.csv')
nwf_df = pd.read_csv('neelwafurat_books_only_isbn.csv')

In [3]:
diwan_df.head()

            ISBN
0  9789957393892
1  9789776743540
2  9789953829012
3  9786009969648
4  9786000234874

In [4]:
nwf_df.head()

            ISBN
0  9789975355210
1  9789773155612
2     9771975889
3  9789957120360
4     1575475278

In [5]:
diwan_df['ISBN'] = diwan_df['ISBN'].astype("string")
nwf_df['ISBN'] = nwf_df['ISBN'].astype("string")

In [6]:
df = pd.concat([diwan_df, nwf_df])

### Check duplicated ISBN and remove them

In [7]:
df.duplicated().sum()

624

In [8]:
df.drop_duplicates(inplace=True)

In [9]:
df.to_csv('all_in_one_isbn_only.csv', index=False)